{
    "title": "Тестовый проект",
    "name": "Андрей Притула",
    "git": "Репозиторий",
    "design": "Реф дизайна",

    "vcsTitle": "Система контроля версий",
    "vcsInfo": "Система управления версиями (от англ. Version Control System, VCS или Revision Control System) — программное обеспечение для облегчения работы с изменяющейся информацией. Система управления версиями позволяет хранить несколько версий одного и того же документа, при необходимости возвращаться к более ранним версиям, определять, кто и когда сделал то или иное изменение, и многое другое.",

    "gitTitle": "Pаспределённая система управления версиями",
    "gitInfo": "Git (произносится «гит») — распределённая система управления версиями. Проект был создан Линусом Торвальдсом для управления разработкой ядра Linux, первая версия выпущена 7 апреля 2005 года. На сегодняшний день его поддерживает Джунио Хамано.",

    "cssTitle": "Каскадные таблицы стилей",
    "cssInfo": "CSS (/siːɛsɛs/ англ. Cascading Style Sheets «каскадные таблицы стилей») — формальный язык описания внешнего вида документа (веб-страницы), написанного с использованием языка разметки (чаще всего HTML или XHTML). Также может применяться к любым XML-документам, например, к SVG или XUL.",

    "htmlTitle": "Язык гипертекстовой разметки",
    "htmlInfo": "HTML (от англ. HyperText Markup Language — «язык гипертекстовой разметки») — стандартизированный язык разметки документов во Всемирной паутине. Большинство веб-страниц содержат описание разметки на языке HTML (или XHTML). Язык HTML интерпретируется браузерами; полученный в результате интерпретации форматированный текст отображается на экране монитора компьютера или мобильного устройства.",

    "nodeTitle": "Программная платформа Node JS",
    "nodeInfo": "Node или Node.js — программная платформа, основанная на движке V8 (транслирующем JavaScript в машинный код), превращающая JavaScript из узкоспециализированного языка в язык общего назначения. Node.js добавляет возможность JavaScript взаимодействовать с устройствами ввода-вывода через свой API, написанный на C++, подключать другие внешние библиотеки, написанные на разных языках, обеспечивая вызовы к ним из JavaScript-кода. Node.js применяется преимущественно на сервере, выполняя роль веб-сервера, но есть возможность разрабатывать на Node.js и десктопные оконные приложения (при помощи NW.js, AppJS или Electron для Linux, Windows и macOS) и даже программировать микроконтроллеры (например, tessel, low.js и espruino). В основе Node.js лежит событийно-ориентированное и асинхронное (или реактивное) программирование с неблокирующим вводом/выводом.",
    
    "npmTitle": "Менеджер пакетов NPM",
    "npmInfo": "Npm (англ. Node Package Manager) — менеджер пакетов, входящий в состав Node.js.",
    
    "tableTitle": "Событие",
    "tableSummary": "Итог",
    "tableLink": "Ссылка",

    "buttonSort" : "Сортировать",
    "person" : "Персона: ",
    "age" : " Возраст: ",
    "bp" : " Место рождения: ",
    "bd" : " Дата рождения: ",
    "themeButton" : "Сменить тему"
}